FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC43xx/LPC43xx_IAP.c
/*-------------------------------------------------------------------------*
 * File:  LPC43xx_IAP.c
 *-------------------------------------------------------------------------*
 * Description:
 *     
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(tm) - Copyright (C) 2007-2011 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(tm) distribution.
 *
 * uEZ(tm) is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * uEZ(tm) is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with uEZ(tm); if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
 *
 * A special exception to the GPL can be applied should you wish to
 * distribute a combined work that includes uEZ(tm), without being obliged
 * to provide the source code for any proprietary components.  See the
* licensing section of http://goo.gl/UDtTCR for full details of how
 * and when the exception can be applied.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------*
 * Includes:
 *-------------------------------------------------------------------------*/
#include "LPC43xx_IAP.h"

#include <uEZ.h>
#include <string.h>
#include <uEZPlatform.h>
#include <uEZDeviceTable.h>
#include <uEZProcessor.h>
#include "LPC43xx_UtilityFuncs.h"

/*-------------------------------------------------------------------------*
 * Constants:
 *-------------------------------------------------------------------------*/
#define MAX_NUM_SECTORS             16//32
#define BLOCK_SIZE                  512

#define IAP_CMD_INIT                49 //May not be needed
#define IAP_CMD_PREPARE_SECTOR      50
#define IAP_CMD_COPY_TO_FLASH       51
#define IAP_CMD_ERASE_SECTOR        52

typedef TUInt32 TIAPResult;
#define CMD_SUCCESS                 0
#define INVALID_COMMAND             1
#define SRC_ADDR_ERROR              2
#define DST_ADDR_ERROR              3
#define SRC_ADDR_NOT_MAPPED         4
#define DST_ADDR_NOT_MAPPED         5
#define COUNT_ERROR                 6
#define INVALID_SECTOR              7
#define SECTOR_NOT_BLANK            8
#define SECTOR_NOT_PREPARED         9
#define COMPARE_ERROR               10
#define BUSY                        11
#define NOTHING_HAPPENED            0xFF

#define IAP_ROUTINE                 (*((TUInt32 *)0x10400100))
#define BLOCK_NONE                  0xFFFFFFFF

#define FLASH_BANK_A                0
#define FLASH_BANK_B                1

#define CONFIG_DISABLE_PLL_ON_IAP_COMMANDS          0
#if CONFIG_DISABLE_PLL_ON_IAP_COMMANDS
#define PRG_FREQUENCY               XTAL_FREQUENCY
#else
#define PRG_FREQUENCY               PROCESSOR_OSCILLATOR_FREQUENCY
#endif

/*-------------------------------------------------------------------------*
 * Types:
 *-------------------------------------------------------------------------*/
typedef struct {
    TInt32 iIndex;
    TUInt32 iAddress;
    TUInt32 iSize;
} T_sector;

typedef struct {
    const DEVICE_Flash *iDevice;
    T_uezSemaphore iSem;
    TUInt32 iNumOpen;
    T_FlashChipInfo iChipInfo;
} T_Flash_NXP_LPC43xx_Workspace;

typedef void (*IAPRoutine)(TUInt32 *aParams, TUInt32 *aResults);
#define IAPCall       ((IAPRoutine)IAP_ROUTINE)

/*-------------------------------------------------------------------------*
 * Prototypes:
 *-------------------------------------------------------------------------*/
static T_uezError IIAPCmdErase(TUInt32 aSector, TUInt32 aBank);
static T_uezError IIAPPrepareSector(TUInt32 aSector, TUInt32 aBank);

/*-------------------------------------------------------------------------*
 * Globals:
 *-------------------------------------------------------------------------*/
//const T_sector G_sectorMemory[MAX_NUM_SECTORS] = {
//#if (LPC43xx_IAP_PROTECT_FIRST_64K==1)
//    {  -1,  0x00000000, 0x00010000 }, // Ignore first 64K
//#else
//    {   0,  0x00000000, 0x00001000 },
//    {   1,  0x00001000, 0x00001000 },
//    {   2,  0x00002000, 0x00001000 },
//    {   3,  0x00003000, 0x00001000 },
//    {   4,  0x00004000, 0x00001000 },
//    {   5,  0x00005000, 0x00001000 },
//    {   6,  0x00006000, 0x00001000 },
//    {   7,  0x00007000, 0x00001000 },
//    {   8,  0x00008000, 0x00001000 },
//    {   9,  0x00009000, 0x00001000 },
//    {  10,  0x0000A000, 0x00001000 },
//    {  11,  0x0000B000, 0x00001000 },
//    {  12,  0x0000C000, 0x00001000 },
//    {  13,  0x0000D000, 0x00001000 },
//    {  14,  0x0000E000, 0x00001000 },
//    {  15,  0x0000F000, 0x00001000 },
//#endif
//    {  16,  0x00010000, 0x00008000 },
//    {  17,  0x00018000, 0x00008000 },
//    {  18,  0x00020000, 0x00008000 },
//    {  19,  0x00028000, 0x00008000 },
//    {  20,  0x00030000, 0x00008000 },
//    {  21,  0x00038000, 0x00008000 },
//    {  22,  0x00040000, 0x00008000 },
//    {  23,  0x00048000, 0x00008000 },
//    {  24,  0x00050000, 0x00008000 },
//    {  25,  0x00058000, 0x00008000 },
//    {  26,  0x00060000, 0x00008000 },
//    {  27,  0x00068000, 0x00008000 },
//    {  28,  0x00070000, 0x00008000 },
//    {  29,  0x00078000, 0x00008000 },
//    {  -1,  0x00080000, 0xFFF80000 }    // Stop here
//};
const T_sector G_sectorMemory_BankA[MAX_NUM_SECTORS] = {
#if (LPC43xx_IAP_PROTECT_FIRST_64K==1)
    {  -1,  0x00000000, 0x00010000 }, // Ignore first 64K
#else
    { 0  , 0x1A000000, 0x00002000 },
    { 1  , 0x1A002000, 0x00002000 },
    { 2  , 0x1A004000, 0x00002000 },
    { 3  , 0x1A006000, 0x00002000 },
    { 4  , 0x1A008000, 0x00002000 },
    { 5  , 0x1A00A000, 0x00002000 },
    { 6  , 0x1A00C000, 0x00002000 },
    { 7  , 0x1A00E000, 0x00002000 },
#endif
    { 8  , 0x1A010000, 0x00010000 },
    { 9  , 0x1A020000, 0x00010000 },
    { 10 , 0x1A030000, 0x00010000 },
    { 11 , 0x1A040000, 0x00010000 },
    { 12 , 0x1A050000, 0x00010000 },
    { 13 , 0x1A060000, 0x00010000 },
    { 14 , 0x1A070000, 0x00010000 },
    { -1 , 0X1A07FFFF, 0xFF80000  },
};

const T_sector G_sectorMemory_BankB[MAX_NUM_SECTORS] = {
    { 0  , 0x1B000000, 0x00002000 },
    { 1  , 0x1B002000, 0x00002000 },
    { 2  , 0x1B004000, 0x00002000 },
    { 3  , 0x1B006000, 0x00002000 },
    { 4  , 0x1B008000, 0x00002000 },
    { 5  , 0x1B00A000, 0x00002000 },
    { 6  , 0x1B00C000, 0x00002000 },
    { 7  , 0x1B00E000, 0x00002000 },
    { 8  , 0x1B010000, 0x00010000 },
    { 9  , 0x1B020000, 0x00010000 },
    { 10 , 0x1B030000, 0x00010000 },
    { 11 , 0x1B040000, 0x00010000 },
    { 12 , 0x1B050000, 0x00010000 },
    { 13 , 0x1B060000, 0x00010000 },
    { 14 , 0x1B070000, 0x00010000 },
    { -1 , 0X1B07FFFF, 0xFF80000  },
};

static TBool G_sectorsNeedingErase_BankA[MAX_NUM_SECTORS];
static TBool G_sectorsNeedingErase_BankB[MAX_NUM_SECTORS];
static TUInt8 G_block[BLOCK_SIZE] IN_INTERNAL_RAM;
static TUInt32 G_parameters[5] IN_INTERNAL_RAM;
static TUInt32 G_results[4] IN_INTERNAL_RAM;
static TUInt32 G_lastBlock;

static TIAPResult IIAPCmd(TUInt8 aCmd)
{
    // Pass on the command
    G_parameters[0] = aCmd;

    // Zap results so we know if nothing happened
    G_results[0] = NOTHING_HAPPENED;

