FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC43xx/LPC43xx_IAP.c
    // Execute with interrupts turned off
    CPUDisableInterrupts();

    // Before doing any IAP commands, turn off the PLL
#if CONFIG_DISABLE_PLL_ON_IAP_COMMANDS
    CPUPLLStop();
#endif

    IAPCall(G_parameters, G_results);

    // Regardless of the result, turn back on the PLL
#if CONFIG_DISABLE_PLL_ON_IAP_COMMANDS
    CPUPLLStart();
#endif

    CPUEnableInterrupts();

    return G_results[0];
}

// This is pretty rediculous code to fix all combinations but the following was tested in compiler explorer:
/* // Check for expected results for addresses we actually use.
    printf("-1: %u\n", IIAPAddressToSectorNumber(0x1a000000, 0));
    printf(" 8: %u\n", IIAPAddressToSectorNumber(0x1a010000, 0));
    printf(" 9: %u\n", IIAPAddressToSectorNumber(0x1a020000, 0));
    printf("14: %u\n", IIAPAddressToSectorNumber(0x1a07FFFF, 0));    
    printf(" 0: %u\n", IIAPAddressToSectorNumber(0x1b000000, 1));
    printf(" 1: %u\n", IIAPAddressToSectorNumber(0x1b002000, 1));
    printf("14: %u\n", IIAPAddressToSectorNumber(0x1b07FFFF, 1));*/

/*---------------------------------------------------------------------------*
 * Routine:  IIAPAddressToSectorNumber
 *---------------------------------------------------------------------------*
 * Description:
 *      Convert the address into a sector number.
 * Outputs:
 *      TUInt32                   -- Sector number, or -1 if invalid.
 *---------------------------------------------------------------------------*/
static TInt32 IIAPAddressToSectorNumber(TUInt32 aAddress, TUInt32 aBank)
{
    const T_sector *p_sector = aBank ? G_sectorMemory_BankB : G_sectorMemory_BankA;
    const T_sector *p_prev = p_sector;

    while (1) {
        if (aAddress < p_sector->iAddress) {
            return p_prev->iIndex;
        }
        p_prev = p_sector;
        p_sector++;
        if (aAddress == p_sector->iAddress) {
            if(p_sector->iIndex != -1) {
                return p_sector->iIndex;
            } else {
                return p_prev->iIndex;
            }
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPEraseIfNotErased
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the given sector if not already erased.
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPEraseIfNotErased(TUInt32 aSector, TUInt32 aBank)
{
    T_uezError error = UEZ_ERROR_NONE;

    if(aBank == FLASH_BANK_A){
        if (G_sectorsNeedingErase_BankA[aSector])
            error = IIAPCmdErase(aSector, aBank);
        else
            error = UEZ_ERROR_NONE;
    } else if(aBank == FLASH_BANK_B){
        if (G_sectorsNeedingErase_BankB[aSector])
            error = IIAPCmdErase(aSector, aBank);
        else
            error = UEZ_ERROR_NONE;
    }
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPCopyBytes
 *---------------------------------------------------------------------------*
 * Description:
 *      Copy in a section of bytes into the block offset by a prefix.
 * Inputs:
 *      TUInt8 *aData -- Pointer to data to read
 *      TUInt32 aPrefix -- Offset into the block to read
 *      TUInt32 aNumBytes -- Number of bytes to read.
 *---------------------------------------------------------------------------*/
static void IIAPCopyBytes(TUInt8 *aData, TUInt32 aPrefix, TUInt32 aNumBytes)
{
    TUInt32 i;

    // Copy over the section of bytes we are going to
    // write
    for (i = 0; i < aNumBytes; i++, aData++)
        G_block[aPrefix++] = *aData;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPCmdErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the given sector.
 * Inputs:
 *      TUInt32 aSector -- Sector to erase
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPCmdErase(TUInt32 aSector, TUInt32 aBank)
{
    T_uezError error;

    IIAPCmd(IAP_CMD_INIT);

    // Prepare the sector for erase
    error = IIAPPrepareSector(aSector, aBank);
    if (error)
        return error;

    // Start sector
    G_parameters[1] = aSector;
    // End sector
    G_parameters[2] = aSector;
    // Clock frequency in kHz
    G_parameters[3] = PRG_FREQUENCY / 1000;

    G_parameters[4] = aBank;

    if (IIAPCmd(IAP_CMD_ERASE_SECTOR) != CMD_SUCCESS)
        return UEZ_ERROR_COULD_NOT_ERASE;

    // Mark sector as erased
    if(aBank == FLASH_BANK_A){
        G_sectorsNeedingErase_BankA[aSector] = EFalse;
    } else {
        G_sectorsNeedingErase_BankB[aSector] = EFalse;
    }

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPPrepareSector
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare a sector for modification.
 * Inputs:
 *      TUInt32 aSector -- Sector to prepare
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPPrepareSector(TUInt32 aSector, TUInt32 aBank)
{
    // Start and end sector are the same
    G_parameters[1] = G_parameters[2] = aSector;
    G_parameters[3] = aBank;

    if (IIAPCmd(IAP_CMD_PREPARE_SECTOR) != CMD_SUCCESS)
        return UEZ_ERROR_INCOMPLETE;

    // Got here?  Then it was good
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPFlashBlock
 *---------------------------------------------------------------------------*
 * Description:
 *      Flash a block of data with the current block.
 * Inputs:
 *      TUInt32 aAddress -- Address to write block
 *      TUInt32 aNumBytes -- Number of bytes to write
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPFlashBlock(TUInt32 aAddress, TUInt32 aNumBytes)
{
    TUInt32 flashBank = FLASH_BANK_A;
    
    if((aAddress & 0xFF000000) == 0x1A000000){
        flashBank = FLASH_BANK_A;
    } else if((aAddress & 0xFF000000) == 0x1B000000){
        flashBank = FLASH_BANK_B;
    } else {
        return UEZ_ERROR_OUT_OF_RANGE;
    }
    
    // First, we have to prep the location
    IIAPPrepareSector(IIAPAddressToSectorNumber(aAddress, flashBank), flashBank);

    // Now we can write the complete block
    G_parameters[1] = aAddress;
    G_parameters[2] = (TUInt32)G_block;
    G_parameters[3] = aNumBytes;
    G_parameters[4] = PRG_FREQUENCY / 1000;

