FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC43xx/LPC43xx_IAP.c
    if (IIAPCmd(IAP_CMD_COPY_TO_FLASH) != CMD_SUCCESS)
        return UEZ_ERROR_READ_WRITE_ERROR;

    // Got here, must have been good
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPSelectBlock
 *---------------------------------------------------------------------------*
 * Description:
 *      Select which block we are going to modify next
 * Inputs:
 *      TUInt32 aBlockAddress -- Address to select
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPSelectBlock(TUInt32 aBlockAddress)
{
    TUInt32 i;
    TInt32 sector;
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 flashBank = FLASH_BANK_A;
    
    if((aBlockAddress & 0xFF000000) == 0x1A000000){
        flashBank = FLASH_BANK_A;
    } else if((aBlockAddress & 0xFF000000) == 0x1B000000){
        flashBank = FLASH_BANK_B;
    } else {
        return UEZ_ERROR_OUT_OF_RANGE;
    }

    // Which sector is this located?
    sector = IIAPAddressToSectorNumber(aBlockAddress, flashBank);

    // Is this allowed?  If not, respond with a failure
    if (sector == -1)
        return UEZ_ERROR_NOT_FOUND;

    // Erase this block if needed.  If error, fail.
    error = IIAPEraseIfNotErased(sector, flashBank);
    if (error)
        return error;

    // Time to write this block to flash.
    // Do the actual write and report if failed.
    error = IIAPFlashBlock(aBlockAddress, BLOCK_SIZE);
    if (error)
        return error;
    
    // Remember what the new block is
    G_lastBlock = aBlockAddress;        
    
    // Fill this block with FFs to match blank flash for next block
    for (i = 0; i < BLOCK_SIZE; i++)
        G_block[i] = 0xFF;        

    // We're good and ready
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPWrite
 *---------------------------------------------------------------------------*
 * Description:
 *      Write a block of data given an address, some data, and
 *      a number of bytes.  Update the address, data pointer, and number
 *      of bytes for the next block.  Only one block is written before
 *      this routine returns.
 * Inputs:
 *      TUInt32 *aAddress -- Pointer to address to write
 *      TUInt8 **aData -- Pointer to a pointer to the data
 *      TUInt32 *aNumBytes -- Pointer to the number of total bytes to write
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPWrite(
    TUInt32 *aAddress,
    TUInt8 **aData,
    TUInt32 *aNumBytes)
{  
    //TUInt32 i;
    TUInt32 prefix;
    TUInt32 numBytes;
    TUInt32 blockAddr;
    T_uezError error = UEZ_ERROR_NONE;

    // How many bytes of 'prefix' (bytes at the front) do we need skip
    prefix = *aAddress % BLOCK_SIZE;

    // How many bytes would be left after the prefix
    numBytes = BLOCK_SIZE - prefix;

    // Trim the number of bytes to what we are asking to write
    if (numBytes > *aNumBytes)
        numBytes = *aNumBytes;

    // Where does this block start (should be <= *aAddress)
    blockAddr = *aAddress - prefix;

    // Copy over the data we are going to write into the buffer that actually writes to flash
    IIAPCopyBytes(*aData, prefix, numBytes);
    
    if (G_lastBlock == BLOCK_NONE) { // first block
      if(*aNumBytes == BLOCK_SIZE) { // first block is full size
        // Switch to the right block in memory, writing the last
        // block if needed
        error = IIAPSelectBlock(blockAddr);
        if (error)
            return error;                

      } else {// first block isn't a full block
         // skip first block since it won't be complete yet until we come back in here.
        G_lastBlock = blockAddr; // set the last block, so when we come in later to finish we end up below.
        return UEZ_ERROR_ILLEGAL_OPERATION; // we need to avoid this now so add an error here to catch it.
      }
    } else { // first block finish or second block
      // If block is complete, then we should write it.
      if((prefix+numBytes) == BLOCK_SIZE) { // we now have a full block to write
          // Switch to the right block in memory, writing the last
          // block if needed
          error = IIAPSelectBlock(blockAddr);
          if (error)
              return error;
          
      } else if (*aNumBytes < BLOCK_SIZE) {
        if(prefix == 0) { // check for the final block that isn't full size.
          // Switch to the right block in memory, writing the last
          // block if needed
          error = IIAPSelectBlock(blockAddr);
          if (error)
              return error;
          // We don't clear the blocks here in case there could be more data coming.
          // So we will write some blocks partial, then completely just to make sure we get the last block.        
        } else { // if prefix isn't zero that means we are trying to write later in the block that we probably already wrote into.
          // Per manual we cannot partially write a block then write over it again later so don't allow the second write.
              return UEZ_ERROR_ILLEGAL_OPERATION;
        }
      }
    }

    // Update for next position
    *aAddress += numBytes;
    *aNumBytes -= numBytes;
    *aData += numBytes;
    
    // Everything went through, should be good now.
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IAPWrite
 *---------------------------------------------------------------------------*
 * Description:
 *      Write a section of bytes in the flash at the given address, with
 *      the given data, and a number of bytes.  Blocks are erased as
 *      needed (if that option was enabled).
 * Inputs:
 *      TUInt32 aAddress -- Address to write at
 *      TUInt8 *aData -- Pointer to data to write
 *      TUInt32 aNumBytes -- Number of bytes to write
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
T_uezError ILPC43xx_IAP_Write(
    TUInt32 aAddress,
    TUInt8 *aData,
    TUInt32 aNumBytes)
{
    T_uezError error = UEZ_ERROR_NONE;

