FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC43xx/LPC43xx_IAP.c
    // Write the given block of data to the given address
    // Cut up the write command into blocks of BLOCK_SIZE size.
    // Keep doing this until all the bytes are processed
    while (aNumBytes) {
        error = IIAPWrite(&aAddress, &aData, &aNumBytes);
        if (error != UEZ_ERROR_NONE) {
            return error;          
        }
    }
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IAPSessionStart
 *---------------------------------------------------------------------------*
 * Description:
 *      Start a new IAP session.  If ETrue is passed in, blocks need to
 *      be erased, otherwise try to overwrite existing blocks.
 *---------------------------------------------------------------------------*/
T_uezError ILPC43xx_IAP_Start(TBool aNeedErasing)
{
    TUInt32 i;

    // Declare all sectors need to be erased
    for (i = 0; i < MAX_NUM_SECTORS; i++){
        G_sectorsNeedingErase_BankA[i] = aNeedErasing;
        G_sectorsNeedingErase_BankB[i] = aNeedErasing;
    }

    //IIAPCmd(IAP_CMD_INIT);

    // Declare no blocks loaded in memory
    G_lastBlock = BLOCK_NONE;
    
      // Fill this block with FFs to match blank flash
      for (i = 0; i < BLOCK_SIZE; i++)
          G_block[i] = 0xFF;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IAPSessionEnd
 *---------------------------------------------------------------------------*
 * Description:
 *      End an IAP session writing any buffered data.
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
T_uezError ILPC43xx_IAP_End(void)
{
    // Write the last block out (if any)
    return IIAPSelectBlock(BLOCK_NONE);
}

/******************************************************************************
 Macro definitions
 ******************************************************************************/

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup of this workspace for Data Flash. For the NXP LPC43xx, we allow the MCU to
 *      access the data flash area.
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_InitializeWorkspace(void *aW)
{
    T_uezError error;

    T_Flash_NXP_LPC43xx_Workspace *p = (T_Flash_NXP_LPC43xx_Workspace *)aW;

    // Then create a semaphore to limit the number of accessors
    error = UEZSemaphoreCreateBinary(&p->iSem);

    p->iNumOpen = 0;
    
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_Open
 *---------------------------------------------------------------------------*
 * Description:
 *      Open the flash device. Initialize the flash
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aAddress            -- Base address into device to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_Open(void *aWorkspace)
{
    T_Flash_NXP_LPC43xx_Workspace *p =
        (T_Flash_NXP_LPC43xx_Workspace *)aWorkspace;
    /* Declare erase operation result container variable */
    p->iNumOpen++;
    if (p->iNumOpen == 1) {
        // If the first time, assume we were in some programming mode
        // and need to reset and Re-enable access to the Flash Data area
        ILPC43xx_IAP_Start(ETrue);
    }

    return ((T_uezError)UEZ_ERROR_NONE);
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_Close
 *---------------------------------------------------------------------------*
 * Description:
 *      Close the flash device.  For the NXP LPC43xx, the flash area access
 *      needs to be closed using IExitProgramMode.
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aAddress            -- Base address into device to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_Close(void *aWorkspace)
{
    T_Flash_NXP_LPC43xx_Workspace *p =
        (T_Flash_NXP_LPC43xx_Workspace *)aWorkspace;
    if (p->iNumOpen) {
        p->iNumOpen--;
        if (p->iNumOpen == 0) {
            ILPC43xx_IAP_End();
        }
        return UEZ_ERROR_NONE;
    } else {
        return UEZ_ERROR_NOT_OPEN;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read bytes out of the Flash.
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte Offset address into flash to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_Read(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt8 *aBuffer,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC43xx_Workspace *p =
        (T_Flash_NXP_LPC43xx_Workspace *)aWorkspace;
    T_uezError error = UEZ_ERROR_NONE;

