FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC43xx/LPC43xx_IAP.c
    // Make sure its not in a programming mode.
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    ILPC43xx_IAP_End();

    // The memory is now accessible, copy the data over
    
    // TODO this check needs to be updated to handle both flash banks
    // Simple copy with check to see if the requested area is within the data flash
    //if ((aOffset + (TUInt32)aNumBytes) <= (512 * 1024)) {
        memcpy(aBuffer, (void *)(aOffset), aNumBytes);
    //} else {
        //UEZSemaphoreRelease(p->iSem);
        //return UEZ_ERROR_OUT_OF_RANGE;
    //}

    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_Write
 *---------------------------------------------------------------------------*
 * Description:
 *      Write bytes into the Flash
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte Offset into flash to write
 *      TUInt8 *aBuffer             -- Pointer to buffer of data
 *      TUInt32 aNumBytes           -- Number of bytes to write
 * Outputs:
 *      T_uezError                  -- Error code.  Returns
 *                                      UEZ_ERROR_BAD_ALIGNMENT if offset
 *                                      or number of bytes
 *                                      is not on word boundary.
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_Write(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt8 *aBuffer,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC43xx_Workspace *p =
        (T_Flash_NXP_LPC43xx_Workspace *)aWorkspace;
    T_uezError error = UEZ_ERROR_NONE;

    // Let's do it
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Write the given block of data to the given address
    // Cut up the write command into blocks of BLOCK_SIZE size.
    // Keep doing this until all the bytes are processed
    while (aNumBytes) {
        error = IIAPWrite(&aOffset, &aBuffer, &aNumBytes);
        if (error != UEZ_ERROR_NONE)
            break;
    }

    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_BlockErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase one or more blocks in the given location
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte offset into the flash memory
 *      TUInt32 aNumBytes           -- Number of bytes
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_BlockErase(
    void *aWorkspace,
    TUInt32 aOffset, //offset name was left for driver compatablity but this value should be the address on the LPC4357
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC43xx_Workspace *p =
        (T_Flash_NXP_LPC43xx_Workspace *)aWorkspace;
    TInt32 blockNum;
    TInt32 blockEnd;

    T_uezError error = UEZ_ERROR_NONE;
    
    TUInt32 flashBank = FLASH_BANK_A;
    
    if((aOffset & 0xFF000000) == 0x1A000000){
        flashBank = FLASH_BANK_A;
    } else if((aOffset & 0xFF000000) == 0x1B000000){
        flashBank = FLASH_BANK_B;
    } else {
        return UEZ_ERROR_OUT_OF_RANGE;
    }

    // No bytes?  Do nothing
    if (aNumBytes == 0)
        return UEZ_ERROR_NONE;

    // Find the block
    blockNum = IIAPAddressToSectorNumber(aOffset, flashBank);
    if (blockNum == -1)
        return UEZ_ERROR_NOT_FOUND;
    blockEnd = IIAPAddressToSectorNumber(aOffset+aNumBytes-1, flashBank);
    if (blockEnd == -1)
        return UEZ_ERROR_NOT_FOUND;

    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Erase that block
    while (blockNum <= blockEnd) {
        error = IIAPEraseIfNotErased(blockNum++, flashBank);
        if (error)
            break;
    }

    // Done erasing, resume normal control
    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_ChipErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the complete chip
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_ChipErase(void *aWorkspace)
{
    T_Flash_NXP_LPC43xx_Workspace *p =
        (T_Flash_NXP_LPC43xx_Workspace *)aWorkspace;
    T_uezError error;
    TUInt32 sector;

    // Prepare the sector for erase
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
#if LPC43xx_IAP_PROTECT_FIRST_64K
    sector=8; // Skip the first 64K of bank A
#else
    sector=0;
#endif      
    for (; sector< MAX_NUM_SECTORS - 2; sector++) {
        error = IIAPPrepareSector(sector, FLASH_BANK_A);
        if (error)
            break;

        // Start sector
        G_parameters[1] = sector;
        // End sector
        G_parameters[2] = sector;
        // Clock frequency in kHz
        G_parameters[3] = PRG_FREQUENCY / 1000;

        if (IIAPCmd(IAP_CMD_ERASE_SECTOR) != CMD_SUCCESS) {
            error = UEZ_ERROR_COULD_NOT_ERASE;
            break;
        }

        // Mark sector as erased
        G_sectorsNeedingErase_BankA[sector] = EFalse;
        break;
    }

    //Erase bank b
    sector=0;     
    
    for (; sector< MAX_NUM_SECTORS - 2; sector++) {
        error = IIAPPrepareSector(sector, FLASH_BANK_B);
        if (error)
            break;

        // Start sector
        G_parameters[1] = sector;
        // End sector
        G_parameters[2] = sector;
        // Clock frequency in kHz
        G_parameters[3] = PRG_FREQUENCY / 1000;

        if (IIAPCmd(IAP_CMD_ERASE_SECTOR) != CMD_SUCCESS) {
            error = UEZ_ERROR_COULD_NOT_ERASE;
            break;
        }

