FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC43xx/LPC43xx_IAP.c
        // Mark sector as erased
        G_sectorsNeedingErase_BankB[sector] = EFalse;
        break;
    }
    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_QueryReg
 *---------------------------------------------------------------------------*
 * Description:
 *      Query the chip for the given register (word based address).
 * Inputs:
 *      void *aWorkspace            -- Workspace
 *      TUInt32 aReg                -- Register to query
 *      TUInt32 *aValue             -- Place to store value returned
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_QueryReg(
    void *aWorkspace,
    TUInt32 aReg,
    TUInt32 *aValue)
{
    T_uezError error = UEZ_ERROR_NONE;
    PARAM_NOT_USED(aWorkspace);
    PARAM_NOT_USED(aReg);

    // Do nothing
    *aValue = 0;

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_GetChipInfo
 *---------------------------------------------------------------------------*
 * Description:
 *      Get information about the chip size
 * Inputs:
 *      void *aW                    -- Workspace
 *      T_FlashChipInfo *aInfo      -- Pointer to structure to receive info
 * Outputs:
 *      T_uezError                   -- Error code.  Returns UEZ_ERROR_NOT_FOUND
 *                                      if flash information is not found
 *                                      (in this case, missing QRY header)
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_GetChipInfo(
    void *aWorkspace,
    T_FlashChipInfo *aInfo)
{
    PARAM_NOT_USED(aWorkspace);

    //TODO: check for accuracy

    // Manually fill in the structure with a list
    // of 16x 4K blocks followed by 14x 16K blocks
    aInfo->iBitWidth = 8;
    aInfo->iNumBytesHigh = 0;
    aInfo->iNumBytesLow = 512*1024;
    aInfo->iNumRegions = 2;
    aInfo->iRegions[0].iNumEraseBlocks = 16;
    aInfo->iRegions[0].iSizeEraseBlock = 4*1024;
    aInfo->iRegions[1].iNumEraseBlocks = 14;
    aInfo->iRegions[1].iSizeEraseBlock = 32*1024;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC43xx_GetBlockInfo
 *---------------------------------------------------------------------------*
 * Description:
 *      Get information about the block
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte offset into flash
 *      T_FlashChipInfo *aInfo      -- Pointer to structure to receive info
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC43xx_GetBlockInfo(
    void *aWorkspace,
    TUInt32 aOffset,
    T_FlashBlockInfo *aBlockInfo)
{

    PARAM_NOT_USED(aWorkspace);
    // Blocks are either 8 or 64KB
    if (aOffset < 0x10000) {
        // 8K blocks (See UM1503 6.5 table 30 sector numbers in manual, referred to as sector size)
        aBlockInfo->iOffset = aOffset & 0xFFFFF000;
        aBlockInfo->iSize = 0x2000;
    } else {
        // 64K blocks (referred to as sector size in manual)
        aBlockInfo->iOffset = aOffset & 0xFFFF0000;
        aBlockInfo->iSize = 0x10000;
    }

    return UEZ_ERROR_NONE;
}

void Flash_NXP_LPC43xx_Create(const char *aName)
{
    UEZDeviceTableRegister(aName,
        (T_uezDeviceInterface *)&Flash_NXP_LPC43xx_Interface, 0, 0);
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const DEVICE_Flash Flash_NXP_LPC43xx_Interface = { {
// Common device interface
    "Flash:NXP:LPC43xx:16Bit",
    0x0100, //<<---- What is the 0x100 stand for??
    Flash_NXP_LPC43xx_InitializeWorkspace,
    sizeof(T_Flash_NXP_LPC43xx_Workspace), },

// Functions
    Flash_NXP_LPC43xx_Open,
    Flash_NXP_LPC43xx_Close,
    Flash_NXP_LPC43xx_Read,
    Flash_NXP_LPC43xx_Write,
    Flash_NXP_LPC43xx_BlockErase,
    Flash_NXP_LPC43xx_ChipErase,
    Flash_NXP_LPC43xx_QueryReg,
    Flash_NXP_LPC43xx_GetChipInfo,
    Flash_NXP_LPC43xx_GetBlockInfo,
    0,
    0,
    0, };

/*-------------------------------------------------------------------------*
 * End of File:  LPC43xx_IAP.c
 *-------------------------------------------------------------------------*/

